In [186]:
import pandas as pd

In [187]:
#import file from C:\Users\sagni\Documents\Personal Files\CS7641\CS7641\Data\Bank_churn
data = pd.read_csv("C:/Users/sagni/Documents/Personal Files/CS7641/CS7641/Data/Bank_churn/train.csv", index_col=0)

In [188]:
%run Source_Be_With_Me.ipynb
eda(data)

Shape
Number of columns are 165034 and number of rows are 13

Data types

CustomerId           int64
Surname             object
CreditScore          int64
Geography           object
Gender              object
Age                float64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard          float64
IsActiveMember     float64
EstimatedSalary    float64
Exited               int64
dtype: object

Sample rows - Top 5

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
id,,,,,,,,,,,,,
0,15674932,Okwudilichukwu,668,France,Male,33.0,3,0.00,2,1.0,0.0,181449.97,0
1,15749177,Okwudiliolisa,627,France,Male,33.0,1,0.00,2,1.0,1.0,49503.50,0
2,15694510,Hsueh,678,France,Male,40.0,10,0.00,2,1.0,0.0,184866.69,0
3,15741417,Kao,581,France,Male,34.0,2,148882.54,1,1.0,1.0,84560.88,0
4,15766172,Chiemenam,716,Spain,Male,33.0,5,0.00,2,1.0,1.0,15068.83,0

EDA Statistics

,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
count,1.65e+05,165034.00,165034.00,165034.00,165034.00,165034.00,165034.00,165034.0,165034.00,165034.00
mean,1.57e+07,656.45,38.13,5.02,55478.09,1.55,0.75,0.5,112574.82,0.21
std,7.14e+04,80.10,8.87,2.81,62817.66,0.55,0.43,0.5,50292.87,0.41
min,1.56e+07,350.00,18.00,0.00,0.00,1.00,0.00,0.0,11.58,0.00
25%,1.56e+07,597.00,32.00,3.00,0.00,1.00,1.00,0.0,74637.57,0.00
50%,1.57e+07,659.00,37.00,5.00,0.00,2.00,1.00,0.0,117948.00,0.00
75%,1.58e+07,710.00,42.00,7.00,119939.52,2.00,1.00,1.0,155152.47,0.00
max,1.58e+07,850.00,92.00,10.00,250898.09,4.00,1.00,1.0,199992.48,1.00

Missing values

Series([], dtype: int64)

Count of Outliers

Age            313
Exited       34921
HasCrCard    40606
dtype: int64

In [189]:
data.drop(['Surname','CustomerId'], axis=1, inplace=True)
data['HasCrCard'] = data['HasCrCard'].astype(int)
data['Age'] = data['Age'].astype(int)
data['IsActiveMember'] = data['IsActiveMember'].astype(int)

In [190]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import make_column_transformer
transformer = make_column_transformer((OneHotEncoder(handle_unknown='ignore'),['Geography','Gender']))

In [191]:
# Transforming
transformed = transformer.fit_transform(data.drop(['Exited'], axis=1))
print(transformed.dtype)
# Transformating back
transformed_df = pd.DataFrame(transformed, columns=transformer.get_feature_names())
# One-hot encoding removed an index. Let's put it back:
transformed_df.index = data.index
# Joining tables
data = pd.concat([data, transformed_df], axis=1)
# Dropping old categorical columns
data.drop(['Geography','Gender'], axis=1, inplace=True)
# CHecking result
data.head()

float64

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,onehotencoder__x0_France,onehotencoder__x0_Germany,onehotencoder__x0_Spain,onehotencoder__x1_Female,onehotencoder__x1_Male
id,,,,,,,,,,,,,,
0,668,33,3,0.00,2,1,0,181449.97,0,1.0,0.0,0.0,0.0,1.0
1,627,33,1,0.00,2,1,1,49503.50,0,1.0,0.0,0.0,0.0,1.0
2,678,40,10,0.00,2,1,0,184866.69,0,1.0,0.0,0.0,0.0,1.0
3,581,34,2,148882.54,1,1,1,84560.88,0,1.0,0.0,0.0,0.0,1.0
4,716,33,5,0.00,2,1,1,15068.83,0,0.0,0.0,1.0,0.0,1.0

In [192]:
trainX, trainY, testX, testY, OOTX, OOTY = stratified_sampling(data, 'Exited', 0.4, 0.5, 903949505)

Original distribution

   counts      %
0  130113  78.84
1   34921  21.16

Train distribution

   counts      %
0   78067  78.84
1   20953  21.16

Test distribution

   counts      %
0   26023  78.84
1    6984  21.16

OOT distribution

   counts      %
0   26023  78.84
1    6984  21.16

Train_x shape
Number of columns are 99020 and number of rows are 13

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,onehotencoder__x0_France,onehotencoder__x0_Germany,onehotencoder__x0_Spain,onehotencoder__x1_Female,onehotencoder__x1_Male
id,,,,,,,,,,,,,
144865,651,34,2,0.00,2,1,1,100995.68,0.0,0.0,1.0,1.0,0.0
5644,745,38,5,0.00,1,1,0,96670.20,1.0,0.0,0.0,0.0,1.0
105829,574,35,1,99774.50,1,0,0,4896.11,0.0,1.0,0.0,1.0,0.0
116624,760,33,3,121593.18,2,1,0,123086.59,0.0,1.0,0.0,1.0,0.0
160685,652,36,1,0.00,2,1,1,44215.86,0.0,0.0,1.0,1.0,0.0

Train_y shape
Number of columns are 99020 and number of rows are 1

        Exited
id
144865       0
5644         0
105829       0
116624       0
160685       0

Train_x shape
Number of columns are 33007 and number of rows are 13

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,onehotencoder__x0_France,onehotencoder__x0_Germany,onehotencoder__x0_Spain,onehotencoder__x1_Female,onehotencoder__x1_Male
id,,,,,,,,,,,,,
89284,662,40,5,99799.76,1,1,1,132562.88,1.0,0.0,0.0,0.0,1.0
25764,814,30,3,123070.89,2,1,0,107825.08,0.0,1.0,0.0,0.0,1.0
109169,691,36,7,0.00,2,1,1,120830.65,0.0,0.0,1.0,1.0,0.0
100843,748,27,2,90971.85,2,1,1,131662.47,0.0,1.0,0.0,1.0,0.0
52000,653,37,9,119556.10,2,1,0,78250.13,1.0,0.0,0.0,1.0,0.0

Train_y shape
Number of columns are 33007 and number of rows are 1

        Exited
id
89284        0
25764        0
109169       0
100843       0
52000        0

OOT_x shape
Number of columns are 33007 and number of rows are 13

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,onehotencoder__x0_France,onehotencoder__x0_Germany,onehotencoder__x0_Spain,onehotencoder__x1_Female,onehotencoder__x1_Male
id,,,,,,,,,,,,,
52931,679,31,3,0.00,2,1,0,132424.69,1.0,0.0,0.0,0.0,1.0
70772,755,45,7,135643.00,1,1,0,143619.52,0.0,1.0,0.0,1.0,0.0
25090,652,43,9,123675.21,1,0,0,166516.86,0.0,1.0,0.0,0.0,1.0
154802,573,31,6,0.00,2,1,1,129955.92,1.0,0.0,0.0,0.0,1.0
42624,706,40,8,0.00,2,1,0,124592.88,1.0,0.0,0.0,0.0,1.0

OOT_y shape
Number of columns are 33007 and number of rows are 1

        Exited
id
52931        0
70772        0
25090        1
154802       0
42624        0

In [193]:
Dtree = decision_tree(X=trainX, Y=trainY)
predictions_test, accuracy_test, f1_test = predict(Dtree, testX, testY)
predictions_OOT, accuracy_OOT, f1_OOT = predict(Dtree, OOTX, OOTY)

Accuracy: 0.7986790680764686
F1 Score: 0.5262032085561498
Accuracy: 0.7994667797739874
F1 Score: 0.5352152236500246

In [197]:
#Testing on OOT dataset
#read data C:\Users\sagni\Documents\Personal Files\CS7641\CS7641\Data\Bank_churn\Test.csv
submission = pd.read_csv("C:/Users/sagni/Documents/Personal Files/CS7641/CS7641/Data/Bank_churn/Test.csv", index_col=0)
submission.drop(['Surname','CustomerId'], axis=1, inplace=True)
submission['HasCrCard'] = submission['HasCrCard'].astype(int)
submission['Age'] = submission['Age'].astype(int)
submission['IsActiveMember'] = submission['IsActiveMember'].astype(int)
# Transforming
transformed = transformer.transform(submission)
# Transformating back
transformed_df = pd.DataFrame(transformed, columns=transformer.get_feature_names())
# One-hot encoding removed an index. Let's put it back:
transformed_df.index = submission.index
# Joining tables
submission = pd.concat([submission, transformed_df], axis=1)
# Dropping old categorical columns
submission.drop(['Geography','Gender'], axis=1, inplace=True)
# CHecking result
eda(submission)
predictions_submission = Dtree.predict(submission)
predictions_submission = pd.DataFrame(predictions_submission, index=submission.index)
#change column names to submi
predictions_submission.columns = ['Exited']
predictions_submission.head()
#export to C:\Users\sagni\Documents\Personal Files\CS7641\CS7641\Data\Bank_churn\submi.csv with index
predictions_submission.to_csv("C:/Users/sagni/Documents/Personal Files/CS7641/CS7641/Data/Bank_churn/submi.csv", index=True)

Shape
Number of columns are 110023 and number of rows are 13

Data types

CreditScore                    int64
Age                            int32
Tenure                         int64
Balance                      float64
NumOfProducts                  int64
HasCrCard                      int32
IsActiveMember                 int32
EstimatedSalary              float64
onehotencoder__x0_France     float64
onehotencoder__x0_Germany    float64
onehotencoder__x0_Spain      float64
onehotencoder__x1_Female     float64
onehotencoder__x1_Male       float64
dtype: object

Sample rows - Top 5

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,onehotencoder__x0_France,onehotencoder__x0_Germany,onehotencoder__x0_Spain,onehotencoder__x1_Female,onehotencoder__x1_Male
id,,,,,,,,,,,,,
165034,586,23,2,0.00,2,0,1,160976.75,1.0,0.0,0.0,1.0,0.0
165035,683,46,2,0.00,1,1,0,72549.27,1.0,0.0,0.0,1.0,0.0
165036,656,34,7,0.00,2,1,0,138882.09,1.0,0.0,0.0,1.0,0.0
165037,681,36,8,0.00,1,1,0,113931.57,1.0,0.0,0.0,0.0,1.0
165038,752,38,10,121263.62,1,1,0,139431.00,0.0,1.0,0.0,0.0,1.0

EDA Statistics

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,onehotencoder__x0_France,onehotencoder__x0_Germany,onehotencoder__x0_Spain,onehotencoder__x1_Female,onehotencoder__x1_Male
count,110023.00,110023.00,110023.00,110023.00,110023.00,110023.00,110023.0,110023.00,110023.00,110023.00,110023.00,110023.00,110023.00
mean,656.53,38.12,5.00,55333.61,1.55,0.75,0.5,112315.15,0.57,0.21,0.22,0.44,0.56
std,80.32,8.86,2.81,62788.52,0.54,0.43,0.5,50277.05,0.49,0.41,0.41,0.50,0.50
min,350.00,18.00,0.00,0.00,1.00,0.00,0.0,11.58,0.00,0.00,0.00,0.00,0.00
25%,597.00,32.00,3.00,0.00,1.00,1.00,0.0,74440.33,0.00,0.00,0.00,0.00,0.00
50%,660.00,37.00,5.00,0.00,2.00,1.00,0.0,117832.23,1.00,0.00,0.00,0.00,1.00
75%,710.00,42.00,7.00,120145.60,2.00,1.00,1.0,154631.35,1.00,0.00,0.00,1.00,1.00
max,850.00,92.00,10.00,250898.09,4.00,1.00,1.0,199992.48,1.00,1.00,1.00,1.00,1.00

Missing values

Series([], dtype: int64)

Count of Outliers

Age                            218
HasCrCard                    27171
onehotencoder__x0_Germany    22939
onehotencoder__x0_Spain      23913
dtype: int64